import React from "react";

export default function logic() {
  return (
    <section className="text-gray-600 body-font">
      <div className="container px-5 py-24 mx-auto">
        <div className="xl:w-1/2 lg:w-3/4 w-full mx-auto text-center">
          <svg
            xmlns="http://www.w3.org/2000/svg"
            fill="currentColor"
            className="inline-block w-8 h-8 text-gray-400 mb-8"
            viewBox="0 0 975.036 975.036"
          >
            <path d="M925.036 57.197h-304c-27.6 0-50 22.4-50 50v304c0 27.601 22.4 50 50 50h145.5c-1.9 79.601-20.4 143.3-55.4 191.2-27.6 37.8-69.399 69.1-125.3 93.8-25.7 11.3-36.8 41.7-24.8 67.101l36 76c11.6 24.399 40.3 35.1 65.1 24.399 66.2-28.6 122.101-64.8 167.7-108.8 55.601-53.7 93.7-114.3 114.3-181.9 20.601-67.6 30.9-159.8 30.9-276.8v-239c0-27.599-22.401-50-50-50zM106.036 913.497c65.4-28.5 121-64.699 166.9-108.6 56.1-53.7 94.4-114.1 115-181.2 20.6-67.1 30.899-159.6 30.899-277.5v-239c0-27.6-22.399-50-50-50h-304c-27.6 0-50 22.4-50 50v304c0 27.601 22.4 50 50 50h145.5c-1.9 79.601-20.4 143.3-55.4 191.2-27.6 37.8-69.4 69.1-125.3 93.8-25.7 11.3-36.8 41.7-24.8 67.101l35.9 75.8c11.601 24.399 40.501 35.2 65.301 24.399z"></path>
          </svg>
          <p className="leading-relaxed text-lg">
            ความมีเหตุผล หมายถึง
            การตัดสินใจเกี่ยวกับระดับของความพอเพียงจะต้องเป็นไปอย่างมีเหตุผล
            โดยพิจารณาจากเหตุปัจจัยที่เกี่ยวข้องตลอดจนคำนึงถึงผลที่คาดว่าจะเกิดขึ้นจากการกระทำนั้นๆอย่างรอบคอบ(ณดา
            จันทร์สม. 2554:
            141)โดยโครงการพัฒนาห้องสมุดวัดเทพพลมีความสอดคล้องกับความมีเหตุผล
            ดังนี้ 1. เล็งเห็นถึงปัญหาที่เกิดขึ้น และเหตุผลในการเลือกทำโครงการ
            เนื่องจากน้ำท่วมครั้งใหญ่ในปีพ.ศ. 2554
            ทำให้เกิดความเสียหายส่งผลกระทบถึงบ้านเรือนประชาชน สถานที่ราชการ
            สถานที่สำคัญต่างๆ รวมถึงวัดที่เป็นศูนย์รวมจิตใจของชาวพุทธ
            ล้วนได้รับความเสียหายและได้รับผลกระทบเช่นกัน
            ซึ่งวัดเทพพลก็เป็นหนึ่งในวัดที่ได้รับผลกระทบจากอุทกภัยครั้งนั้น
            รวมถึงห้องสมุดก็เป็นสถานที่หนึ่งภายในวัดที่ได้รับความเสียหายแต่มีการฟื้นฟูไปบ้างแล้วในบางส่วน
            คือ มีการคัดแยกหนังสือที่ชำรุด, จัดเรียงหนังสือเข้าชั้น
            และทำความสะอาด แต่ยังไม่ได้ซ่อมแซมหนังสือที่ชำรุดให้สภาพดีได้ทั้งหมด
            ห้องสมุดวัดเทพพลมิใช่เป็นเพียงสถานที่ศึกษาหาความรู้เพิ่มเติมของพระสงฆ์หรือสามเณรเพียงอย่างเดียวเท่านั้น
            บุคคลในชุมชนหรือบุคคลทั่วไปที่สนใจก็สามารถเข้าใช้บริการได้
            ยังมีนักศึกษาที่มาเรียนศูนย์การศึกษานอกโรงเรียนภายในวัด
            ก็สามารถเข้ามาหาความรู้เพิ่มเติมได้ เพราะห้องสมุดเปิดบริการทุกวัน
            ไม่มีวันหยุด
            เป็นเหตุผลให้กลุ่มผู้ดำเนินโครงการเลือกที่จะมาพัฒนาห้องสมุดวัดเทพ-พลแห่งนี้
            โดยมีการลงมติสิ่งที่จะพัฒนาห้องสมุดได้ คือ
            การซ่อมแซมหนังสือให้สามารถใช้งานได้, จัดเก็บหนังสือให้เรียบร้อย,
            ติดป้ายคำเตือนต่างๆ, จัดวางโต๊ะ เก้าอี้ และทำความสะอาดห้องสมุด
            เพื่อพัฒนาห้องสมุดวัดเทพพลให้มีสภาพเหมาะสมแก่การศึกษาค้นคว้า
            ต่อพระสงฆ์ สามเณร และบุคคลทั่วไป 2. เล็งเห็นความสำคัญ
            และเหตุผลในการพัฒนาห้องสมุด ห้องสมุด เป็นแหล่งศึกษาหาความรู้
            ให้ข้อมูลข่าวสาร ได้อย่างหลากหลาย ตามความสนใจ
            พร้อมทั้งยังทำให้เกิดกำลังความคิด เกิดนิสัยรักการอ่าน
            เนื่องจากข้อมูล ข่าวสาร ความรู้ต่างๆ
            ในปัจจุบันนั้นเกิดขึ้นใหม่ตลอดเวลา มีการปรับเปลี่ยนไปตามยุคสมัย
            และอีกทั้งยังเป็นการง่ายต่อการเข้าถึงแหล่งความรู้ทางธรรมะ
            การส่งเสริมด้านคุณธรรม ศีลธรรม จริยธรรม
            ของพุทธศาสนิกชนผู้เข้ามาใช้สถานที่ในวัดตามโอกาสต่างๆ
            หรืออาจจะเพื่อขัดเกลาจิตใจพุทธศาสนิกชนชาวพุทธให้สนใจในทางธรรมมากยิ่งขึ้น
            มาศึกษาค้นคว้าความรู้ทางธรรมเพิ่มเติมเพื่อให้เกิดแรงยึดเหนี่ยวทางจิตใจที่มั่นคงต่อพระพุทธศาสนา
            เนื่องจากวิถีชีวิต
            และสถานการณ์ต่างๆที่เกิดขึ้นในสังคมปัจจุบันที่พบเจอแต่ปัญหามากมาย
            ศาสนาจึงมีบทบาทช่วยเหลือมนุษย์มากยิ่งขึ้น เช่น
            เป็นที่ยึดเหนี่ยวจิตใจผู้คนให้หันมาใฝ่ทางดี คิดก่อนทำ ใช้วิจารณญาณ
            เหตุผลในการรับรู้หรือเชื่อข่าวสารต่างๆ
            คิดวิเคราะห์แก้ปัญหาอย่างถูกต้อง เป็นต้น ห้องสมุดที่น่าใช้งาน
            มีความสะดวกสบาย จะเป็นการชักจูงให้ผู้คนหันมาเข้าวัดมากขึ้น
            จึงเป็นเหตุผลที่สมควรในการพัฒนาห้องสมุดอย่างยิ่ง 2.
            คำนึงถึงหลักเหตุและผลที่สมควรในการทำโครงการแต่ละขั้นตอน
            ในด้านของวิธีการซ่อมแซมหนังสือที่หาได้จากหอสมุด
            ที่กลุ่มผู้ดำเนินโครงการได้ไปศึกษาค้นคว้า
            จำเป็นต้องใช้เครื่องเย็บหนังสือที่มีราคาสูง
            หากจะซื้อเพื่อให้อุปกรณ์การทำงานครบตามขั้นตอนการซ่อมแซมหนังสือจากการค้นคว้าของกลุ่มผู้ดำเนินโครงการนั้น
            จะทำให้ใช้เงินเกินงบประมาณที่จัดสรรไว้ ถ้าหากซื้อมาดำเนินโครงการ
            เมื่อซ่อมแซมหนังสือเสร็จ
            เครื่องเย็บราคาสูงที่ซื้อมานี้ก็จะไม่ได้ใช้งานต่อ
            ไม่คุ้มค่ากับการลงทุน จึงต้องคำนึงถึง
            หลักความมีเหตุผลตามแนวคิดปรัชญาเศรษฐกิจพอเพียงของพระบาทสมเด็จพระเจ้าอยู่หัวฯ
            มาเป็นหลักในการดำเนินงาน คือ
            นำวิธีที่ค้นคว้าได้มาประยุกต์ใช้โดยไม่จำเป็นต้องมีเครื่องเย็บหนังสือ
            เพื่อดัดแปลงให้เหมาะสมและสะดวกต่อการดำเนินงาน
            จึงใช้กาวลาเท็กซ์หรือกระดาษกาวสองหน้าติดให้หนังสือส่วนที่หลุดออกจากเล่มให้อยู่ในสภาพที่สามารถใช้งานได้เหมือนเดิม
            และแบ่งการซ่อมแซมปกหนังสือเป็น 2 วิธี คือ วิธีห่อแบบปกแข็ง และ
            วิธีห่อแบบปกอ่อน โดยแยกตามระดับความเสียหายของหนังสือ ถ้าเสียหายมาก
            จะใช้ปกแข็งหุ้มแล้วเขียนปกใหม่ แต่ถ้าเสียหายน้อยก็จะใช้ปกอ่อนห่อแทน
            2. เนื่องจากมี 2 กลุ่ม ทำโครงการที่วัดเทพพลแห่งเดียวกัน
            เพื่อเป็นการประหยัดค่าใช้จ่ายและสะดวกในการเดินทางไปและกลับ
            จึงเป็นเหตุผลที่ต้องรวมกลุ่มไปทำงานพร้อมกัน ในวันและเวลาเดียวกัน
          </p>
          <span className="inline-block h-1 w-10 rounded bg-indigo-500 mt-8 mb-6"></span>
          <h2 className="text-gray-900 font-medium title-font tracking-wider text-sm">
            นายณัฐวุฒิ สุวรรณศรี
          </h2>
          <p className="text-gray-500">นิสิต ดี</p>
        </div>
      </div>
    </section>
  );
}
